{

	"Titre": "RFC Sheet number 3",
	"Section": "<h2>Adaptation of RFC 1149 for IPv6</h2>\n    <article>\n        <h3>Abstract</h3>\n        <p>This document specifies a method for transmission of IPv6 datagrams \n        over the same medium as specified for IPv4 datagrams in RFC 1149.</p>\n    </article>\n    <article>\n        <h3>Status of This Memo</h3>\n        <p>This document is not an Internet Standards Track specification; it is \n        published for informational purposes.</p>\n        <p>This is a contribution to the RFC Series, independently of any other\n        RFC stream.  The RFC Editor has chosen to publish this document at\n        its discretion and makes no statement about its value for\n        implementation or deployment.  Documents approved for publication by\n        the RFC Editor are not a candidate for any level of Internet\n        Standard; see Section 2 of RFC 5741.</p>\n        <p>Information about the current status of this document, any errata,\n        and how to provide feedback on it may be obtained at\n        http://www.rfc-editor.org/info/rfc6214.</p>\n    </article>\n    <article>\n        <h3>Copyright Notice</h3>\n        <p>Copyright (c) 2011 IETF Trust and the persons identified as the\n        document authors.  All rights reserved.</p>\n        <p>This document is subject to BCP 78 and the IETF Trust's Legal\n        Provisions Relating to IETF Documents\n        (http://trustee.ietf.org/license-info) in effect on the date of\n        publication of this document.  Please review these documents\n        carefully, as they describe your rights and restrictions with respect\n        to this document.</p>\n        <p>Information about the current status of this document, any errata,\n        and how to provide feedback on it may be obtained at\n        http://www.rfc-editor.org/info/rfc6214.</p>\n    </article>\n    <nav>\n        <h3>Table of Contents</h3>\n        <ol>\n            <li><a href=\"#Introduction\">Introduction</a></li>\n            <li><a href=\"#Dormative-Notation\">Normative Notation</a></li>\n            <li><a href=\"#Detailed-Specification\">Detailed Specification</a>\n                <ol>\n                    <li><a href=\"#Maximum-Transmission-Unit\">Maximum Transmission Unit</a></li>\n                    <li><a href=\"#Frame-Format\">Frame Format</a></li>\n                    <li><a href=\"#Address-Configuration\">Address Configuration</a></li>\n                    <li><a href=\"#Multicast\">Multicast</a></li>\n                </ol>\n            </li>\n            </li>\n            <li><a href=\"#Quality-of-Service-Considerations\">Quality-of-Service Considerations</a></li>\n            <li><a href=\"#Routing-and-Tunneling-Considerations\">Routing and Tunneling Considerations</a></li>\n            <li><a href=\"#Multihoming-Considerations\">Multihoming Considerations</a></li>\n            <li><a href=\"#Internationalization-Considerations\">Internationalization Considerations</a></li>\n            <li><a href=\"#Security-Considerations\">Security Considerations</a></li>\n            <li><a href=\"#IANA-Considerations\">IANA Considerations</a></li>\n            <li><a href=\"#Acknowledgements\">Acknowledgements</a></li>\n            <li><a href=\"#References\">References</a>\n                <ol>\n                    <li><a href=\"#Normative-References\">Normative References</a></li>\n                    <li><a href=\"#Informative-References\">Informative References</a></li>\n                </ol>\n            </li>\n        </ol>\n    </nav>\n    <article>\n        <h3 id=\"Introduction\">1. Introduction</h3>\n        <p>As shown by [RFC6036], many service providers are actively planning\n        to deploy IPv6 to alleviate the imminent shortage of IPv4 addresses.\n        This will affect all service providers who have implemented [RFC1149].  \n        It is therefore necessary, indeed urgent, to specify a\n        method of transmitting IPv6 datagrams [RFC2460] over the RFC 1149\n        medium, rather than obliging those service providers to migrate to a\n        different medium. This document offers such a specification.</p>\n    </article>\n    <article>\n        <h3 id=\"Normative-Notation\">2. Normative Notation</h3>\n        <p>The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\",\n        \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this\n        document are to be interpreted as described in [RFC2119].</p>\n    </article>\n    <article>\n        <h3 id=\"Detailed-Specification\">3. Detailed Specification</h3>\n        <p>Unless otherwise stated, the provisions of [RFC1149] and [RFC2460]\n        apply throughout.</p>\n    </article>\n    <article>\n        <h3 id=\"Maximum-Transmission-Unit\">3.1 Maximum Transmission Unit</h3>\n        <p>As noted in RFC 1149, the MTU is variable, and generally increases\n        with increased carrier age.  Since the minimum link MTU allowed by\n        RFC 2460 is 1280 octets, this means that older carriers MUST be used\n        for IPv6. RFC 1149 does not provide exact conversion factors between\n        age and milligrams, or between milligrams and octets. These conversion factors are implementation dependent, but as an\n        illustrative example, we assume that the 256 milligram MTU suggested\n        in RFC 1149 corresponds to an MTU of 576 octets. In that case, the\n        typical MTU for the present specification will be at least\n        256*1280/576, which is approximately 569 milligrams.  Again as an\n        illustrative example, this is likely to require a carrier age of at\n        least 365 days.</p>\n        <p>Furthermore, the MTU issues are non-linear with carrier age.  That\n        is, a young carrier can only carry small payloads, an adult carrier\n        can carry jumbograms [RFC2675], and an elderly carrier can again\n        carry only smaller payloads.  There is also an effect on transit time\n        depending on carrier age, affecting bandwidth-delay product and hence\n        the performance of TCP.</p>\n    </article>\n    <article>\n        <h3 id=\"Frame-Format\">3.2 Frame Format</h3>\n        <p>RFC 1149 does not specify the use of any link layer tag such as an\n        Ethertype or, worse, an OSI Link Layer or SNAP header [RFC1042].\n        Indeed, header snaps are known to worsen the quality of service\n        provided by RFC 1149 carriers.  In the interests of efficiency and to\n        avoid excessive energy consumption while packets are in flight\n        through the network, no such link layer tag is required for IPv6\n        packets either.  The frame format is therefore a pure IPv6 packet as\n        defined in [RFC2460], encoded and decoded as defined in [RFC1149].</p>\n        <p>One important consequence of this is that in a dual-stack deployment\n        [RFC4213], the receiver MUST inspect the IP protocol version number\n        in the first four bits of every packet, as the only means to\n        demultiplex a mixture of IPv4 and IPv6 packets.</p>\n    </article>\n    <article>\n        <h3 id=\"Address-Configuration\">3.3 Address Configuration</h3>\n        <p>The lack of any form of link layer protocol means that link-local\n        addresses cannot be formed, as there is no way to address anything\n        except the other end of the link.</p>\n        <p>Similarly, there is no method to map an IPv6 unicast address to a\n        link layer address, since there is no link layer address in the first\n        place.  IPv6 Neighbor Discovery [RFC4861] is therefore impossible.</p>\n        <p>Implementations SHOULD NOT even try to use stateless address auto-\n        configuration [RFC4862].  This recommendation is because this\n        mechanism requires a stable interface identifier formed in a way\n        compatible with [RFC4291].  Unfortunately the transmission elements\n        specified by RFC 1149 are not generally stable enough for this and\n        may become highly unstable in the presence of a cross-wind.</p>\n        <p>In most deployments, either the end points of the link remain\n        unnumbered, or a /127 prefix and static addresses MAY be assigned.\n        See [IPv6-PREFIXLEN] for further discussion.</p>\n    </article>\n    <article>\n        <h3 id=\"Multicast\">3.4 Multicast</h3>\n        <p>RFC 1149 does not specify a multicast address mapping.  It has been\n        reported that attempts to implement IPv4 multicast delivery have\n        resulted in excessive noise in transmission elements, with subsequent\n        drops of packet digests.  At the present time, an IPv6 multicast\n        mapping has not been specified, to avoid such problems.</p>\n    </article>\n    <article>\n        <h3 id=\"Quality-of-Service-Considerations\">4. Quality-of-Service Considerations</h3>\n        <p>[RFC2549] is also applicable in the IPv6 case.  However, the author\n        of RFC 2549 did not take account of the availability of the\n        Differentiated Services model [RFC2474].  IPv6 packets carrying a\n        non-default Differentiated Services Code Point (DSCP) value in their\n        Traffic Class field [RFC2460] MUST be specially encoded using green\n        or blue ink such that the DSCP is externally visible.  Note that red\n        ink MUST NOT be used to avoid confusion with the usage of red paint\n        specified in RFC 2549.</p>\n        <p>RFC 2549 did not consider the impact on quality of service of\n        different types of carriers.  There is a broad range.  Some are very\n        fast but can only carry small payloads and transit short distances,\n        others are slower but carry large payloads and transit very large\n        distances.  It may be appropriate to select the individual carrier\n        for a packet on the basis of its DSCP value.  Indeed, different\n        carriers will implement different per-hop behaviors according to RFC\n        2474.</p>\n    </article>\n    <article>\n        <h3 id=\"Routing-and-Tunneling-Considerations\">5. Routing and Tunneling Considerations</h3>\n        <p>Routing carriers through the territory of similar carriers, without\n        peering agreements, will sometimes cause abrupt route changes,\n        looping packets, and out-of-order delivery.  Similarly, routing\n        carriers through the territory of predatory carriers may potentially\n        cause severe packet loss.  It is strongly recommended that these\n        factors be considered in the routing algorithm used to create carrier\n        routing tables.  Implementers should consider policy-based routing to\n        ensure reliable packet delivery by routing around areas where\n        territorial and predatory carriers are prevalent.</p>\n        <p>There is evidence that some carriers have a propensity to eat other\n        carriers and then carry the eaten payloads.  Perhaps this provides a\n        new way to tunnel an IPv4 packet in an IPv6 payload, or vice versa.</p>\n        <p>However, the decapsulation mechanism is unclear at the time of this\n        writing.</p>\n    </article>\n    <article>\n        <h3 id=\"Multihoming-Considerations\">6. Multihoming Considerations</h3>\n        <p>Some types of carriers are notoriously good at homing.  Surprisingly,\n        this property is not mentioned in RFC 1149. Unfortunately, they\n        prove to have no talent for multihoming, and in fact enter a routing\n        loop whenever multihoming is attempted.  This appears to be a\n        fundamental restriction on the topologies in which both RFC 1149 and\n        the present specification can be deployed.</p>\n    </article>\n    <article>\n        <h3 id=\"Internationalization-Considerations\">7. Internationalization Considerations</h3>\n        <p>In some locations, such as New Zealand, a significant proportion of\n        carriers are only able to execute short hops, and only at times when\n        the background level of photon emission is extremely low.  This will\n        impact the availability and throughput of the solution in such\n        locations.</p>\n    </article>\n    <article>\n        <h3 id=\"Security-Considerations\">8. Security Considerations</h3>\n        <p>The security considerations of [RFC1149] apply.  In addition, recent\n        experience suggests that the transmission elements are exposed to\n        many different forms of denial-of-service attacks, especially when\n        perching.  Also, the absence of link layer identifiers referred to\n        above, combined with the lack of checksums in the IPv6 header,\n        basically means that any transmission element could be mistaken for\n        any other, with no means of detecting the substitution at the network\n        layer.  The use of an upper-layer security mechanism of some kind\n        seems like a really good idea.</p>\n        <p>There is a known risk of infection by the so-called H5N1 virus.\n        Appropriate detection and quarantine measures MUST be available.</p>\n    </article>\n    <article>\n        <h3 id=\"IANA-Considerations\">9. IANA Considerations</h3>\n        <p>This document requests no action by IANA.  However, registry clean-up\n        may be necessary after interoperability testing, especially if\n        multicast has been attempted.</p>\n    </article>\n    <article>\n        <h3 id=\"Acknowledgements\">10. Acknowledgements</h3>\n        <p>Steve Deering was kind enough to review this document for conformance\n        with IPv6 requirements.  We acknowledge in advance the many errata in\n        this document that will be reported by Alfred Hoenes.</p>\n        <p>This document was produced using the xml2rfc tool [RFC2629].</p>\n    </article>\n    <article>\n        <h3 id=\"References\">11. References</h3>\n    </article>\n    <article>\n        <h3 id=\"Normative-References\">11.1 Normative References</h3>\n        <pre>[RFC1149]         Waitzman, D., \"Standard for the transmission of IP\n                     datagrams on avian carriers\", RFC 1149, April 1990.</pre>\n        <pre>[RFC2119]         Bradner, S., \"Key words for use in RFCs to Indicate\n                     Requirement Levels\", BCP 14, RFC 2119, March 1997.</pre>\n        <pre>[RFC2460]         Deering, S. and R. Hinden, \"Internet Protocol,\n                     Version 6 (IPv6) Specification\", RFC 2460,\n                     December 1998.</pre>\n        <pre>[RFC2474]         Nichols, K., Blake, S., Baker, F., and D. Black,\n                     \"Definition of the Differentiated Services Field\n                     (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474,\n                     December 1998.</pre>\n        <pre>[RFC2675]         Borman, D., Deering, S., and R. Hinden, \"IPv6\n                     Jumbograms\", RFC 2675, August 1999.</pre>\n        <pre>[RFC4213]         Nordmark, E. and R. Gilligan, \"Basic Transition\n                     Mechanisms for IPv6 Hosts and Routers\", RFC 4213,\n                     October 2005.</pre>\n    </article>\n    <article>\n        <h3 id=\"Informative-References\">11.2 Informative References</h3>\n        <pre>[IPv6-PREFIXLEN]  Kohno, M., Nitzan, B., Bush, R., Matsuzaki, Y.,\n                     Colitti, L., and T. Narten, \"Using 127-bit IPv6\n                     Prefixes on Inter-Router Links\", Work in Progress,\n                     October 2010.</pre>\n        <pre>[RFC1042]         Postel, J. and J. Reynolds, \"Standard for the\n                     transmission of IP datagrams over IEEE 802\n                     networks\", STD 43, RFC 1042, February 1988.</pre>\n        <pre>[RFC2549]         Waitzman, D., \"IP over Avian Carriers with Quality\n                     of Service\", RFC 2549, April 1999.</pre>\n        <pre>[RFC2629]         Rose, M., \"Writing I-Ds and RFCs using XML\",\n                     RFC 2629, June 1999.</pre>\n        <pre>[RFC4291]         Hinden, R. and S. Deering, \"IP Version 6 Addressing\n                     Architecture\", RFC 4291, February 2006.</pre>\n        <pre>[RFC4861]         Narten, T., Nordmark, E., Simpson, W., and H.\n                     Soliman, \"Neighbor Discovery for IP version 6\n                     (IPv6)\", RFC 4861, September 2007.</pre>\n        <pre>[RFC4862]         Thomson, S., Narten, T., and T. Jinmei, \"IPv6\n                     Stateless Address Autoconfiguration\", RFC 4862,\n                     September 2007.</pre>\n        <pre>[RFC6036]         Carpenter, B. and S. Jiang, \"Emerging Service\n                     Provider Scenarios for IPv6 Deployment\", RFC 6036,\n                     October 2010.</pre>\n    </article>\n    <article>\n        <h3>Author's Address</h3>\n        <p> David Waitzman<br>\n            BBN Systems and Technologies Corporation<br>\n            BBN Labs Division<br>\n            10 Moulton Street<br>\n            Cambridge, MA 02238<br><br>\n            Phone: (617) 873-4323<br><br>\n            EMail: dwaitzman@BBN.COM</p>\n    </article>",
	"Url": "?page=3"

}
